# Chapter 7

In [4]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]])

In [13]:
cleaned = data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))

In [21]:
df.iloc[:4, 1] = NA

In [22]:
df.iloc[:2,2] = NA

In [23]:
df

          0         1         2
0 -0.507889       NaN       NaN
1  0.219972       NaN       NaN
2 -0.642404       NaN -2.732503
3  0.355794       NaN  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [24]:
df.dropna()

          0         1         2
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [25]:
df.dropna(thresh=2)

          0         1         2
2 -0.642404       NaN -2.732503
3  0.355794       NaN  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [26]:
df.fillna(0)

          0         1         2
0 -0.507889  0.000000  0.000000
1  0.219972  0.000000  0.000000
2 -0.642404  0.000000 -2.732503
3  0.355794  0.000000  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [27]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0 -0.507889  0.500000  0.000000
1  0.219972  0.500000  0.000000
2 -0.642404  0.500000 -2.732503
3  0.355794  0.500000  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [28]:
df.fillna(0, inplace=True)

In [29]:
df

          0         1         2
0 -0.507889  0.000000  0.000000
1  0.219972  0.000000  0.000000
2 -0.642404  0.000000 -2.732503
3  0.355794  0.000000  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [31]:
df = pd.DataFrame(np.random.randn(6,3))

In [38]:
df.iloc[2:, 1] = NA

In [39]:
df.iloc[4:, 2] = NA

In [40]:
df

          0         1         2
0  0.827900  0.968600 -0.261543
1 -1.345215  0.742596  2.254011
2  0.793274       NaN -0.568976
3  0.649154       NaN  0.958140
4  1.425643       NaN       NaN
5 -0.737703       NaN       NaN

In [41]:
df.fillna(method = 'ffill')

          0         1         2
0  0.827900  0.968600 -0.261543
1 -1.345215  0.742596  2.254011
2  0.793274  0.742596 -0.568976
3  0.649154  0.742596  0.958140
4  1.425643  0.742596  0.958140
5 -0.737703  0.742596  0.958140

In [42]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.827900  0.968600 -0.261543
1 -1.345215  0.742596  2.254011
2  0.793274  0.742596 -0.568976
3  0.649154  0.742596  0.958140
4  1.425643       NaN  0.958140
5 -0.737703       NaN  0.958140

In [43]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [44]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [45]:
data = pd.DataFrame({'k1': ['one', 'two']*3 + ['two'], 
                     'k2': [1,1,2,3,3,4,4]})

In [46]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data['v1'] = range(7)

In [50]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [51]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [52]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [53]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [54]:
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [55]:
lowercased = data['food'].str.lower()

In [56]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [58]:
data['animal'] = lowercased.map(meat_to_animal)

In [59]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [60]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [61]:
data = pd.Series([1., -999., 2., -999, -1000., 3.])

In [62]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [64]:
data.replace([-999, -1000],[np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [65]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [68]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=['Ohio', 'Colorado', 'New York'],
                          columns=['one', 'two', 'three', 'four'])

In [70]:
transform = lambda x: x[:4].upper()

In [71]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [72]:
data.rename(index=str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [73]:
data.rename(index = {'Ohio':'INDIANA'},
           columns = {'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [74]:
data.rename(index={'Ohio': 'INDIANA'}, inplace=True)

In [75]:
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [76]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [77]:
bins = [18, 25, 35, 60, 100]

In [78]:
cats = pd.cut(ages, bins)

In [79]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [80]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [81]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [83]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [84]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [85]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [86]:
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [ ]:
data = np.random.rand